a=6
b=5
pole=[['*','*','*','*','*','*','*','*','*','*'],
        ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*'],
          ['*','*','*','*','*','*','*','*','*','*']] 
pole[a][b]='O'
for stroka in pole:
    for kletka in stroka:
        print(kletka,end='')
    print()
while True:
    k=input('Введите комманду:вверх,влево,вправо,вниз')
    if k=='вверх':
        pole[a][b]='*'
        a-1
        pole[a][b]='O'
        
    elif k=='влево':
        pole[a][b]='*'
        b-1
        pole[a][b]='O'
    elif k=='вниз':
        pole[a][b]='*'
        a+1
        pole[a][b]='O'
    elif k=='вправо':
        pole[a][b]='*'
        b+1
        pole[a][b]='O'
for stroka in pole:
    for kletka in stroka:
        print(kletka,end='')
    print()